[
   {
      "PPI" : "PPI::Statement",
      "value" : "\"La Nación española, deseando establecer la justicia, la libertad y la seguridad y promover el bien de cuantos la integran, en uso de su soberanía, proclama su voluntad de:Garantizar la convivencia democrática dentro de la Constitución y de las leyes conforme a un orden económico y social justo. Consolidar un Estado de Derecho que asegure el imperio de la ley como expresión de la voluntad popular. Proteger a todos los españoles y pueblos de España en el ejercicio de los derechos humanos, sus culturas y tradiciones, lenguas e instituciones. Promover el progreso de la cultura y de la economía para asegurar a todos una digna calidad de vida. Establecer una sociedad democrática avanzada, y Colaborar en el fortalecimiento de unas relaciones pacíficas y de eficaz cooperación entre todos los pueblos de la Tierra. \"",
      "file" : "/var/tmp/arv_97EN2F/Data-ES-Senado-0.0.7/lib/Data/ES/Senado.pm",
      "package" : "Data::ES::Senado"
   },
   {
      "PPI" : "PPI::Statement",
      "value" : "\"El mandato de los senadores termina cuatro años después de su elección o el día de la disolución de la Cámara, que puede tener lugar conjunta o separadamente de la disolución del Congreso de los Diputados; el derecho de disolución corresponde al Rey, que lo ejerce a petición del Presidente del Gobierno y bajo la exclusiva responsabilidad de éste.\"",
      "file" : "/var/tmp/arv_97EN2F/Data-ES-Senado-0.0.7/lib/Data/ES/Senado/Result/Intervencion_Actividades.pm",
      "package" : "Data::ES::Senado::Result::Intervencion_Actividades"
   },
   {
      "PPI" : "PPI::Statement",
      "value" : "\"El Senado se compone de un número variable de senadores, elegidos por un sistema mixto\"",
      "file" : "/var/tmp/arv_97EN2F/Data-ES-Senado-0.0.7/lib/Data/ES/Senado/Result/Actividades.pm",
      "package" : "Data::ES::Senado::Result::Actividades"
   },
   {
      "PPI" : "PPI::Statement",
      "value" : "\"El régimen de elección de los senadores hace del Senado una cámara de representación territorial, aunque en la actualidad se debate la idea de reformar la Constitución a fin de reafirmar este carácter; posibles soluciones serían la eliminación de las circunscripciones provinciales, la atribución a los órganos de las comunidades autónomas de la elección de la totalidad de los senadores o la unión de la condición de senador a la de miembro del Gobierno autonómico respectivo.\"",
      "file" : "/var/tmp/arv_97EN2F/Data-ES-Senado-0.0.7/lib/Data/ES/Senado/Result/Descriptores_Actividad.pm",
      "package" : "Data::ES::Senado::Result::Descriptores_Actividad"
   },
   {
      "PPI" : "PPI::Statement",
      "value" : "\"La democracia se basa en el equilibrio de poderes\"",
      "file" : "/var/tmp/arv_97EN2F/Data-ES-Senado-0.0.7/lib/Data/ES/Senado/Result/Personas.pm",
      "package" : "Data::ES::Senado::Result::Personas"
   }
]
