[
   {
      "PPI" : "PPI::Statement::Sub",
      "bad" : "sub bla {\n    my $self = shift;`\n} \n\n\n\n=head1 DIAGNOSTICS\n\n=for author to fill in:\n    List every single error and warning message that the module can\n    generate (even the ones that will \"never happen\"), with a full\n    explanation of each problem, one or more likely causes, and any\n    suggested remedies.\n\n=over\n\n=item C<< Error message here, perhaps with %s placeholders >>\n\n[Description of error here]\n\n=item C<< Another error message here >>\n\n[Description of error here]\n\n[Et cetera, et cetera]\n\n=back\n\n\n=head1 CONFIGURATION AND ENVIRONMENT\n\n=for author to fill in:\n    A full explanation of any configuration system(s) used by the\n    module, including the names and locations of any configuration\n    files, and the meaning of any environment variables or properties\n    that can be set. These descriptions must also include details of any\n    configuration language used.\n  \nRT::Extension::ReassignOwner requires no configuration files or environment variables.\n\n\n=head1 DEPENDENCIES\n\n=for author to fill in:\n    A list of all the other modules that this module relies upon,\n    including any restrictions on versions, and an indication whether\n    the module is part of the standard Perl distribution, part of the\n    module's distribution, or must be installed separately. ]\n\nNone.\n\n\n=head1 INCOMPATIBILITIES\n\n=for author to fill in:\n    A list of any modules that this module cannot be used in conjunction\n    with. This may be due to name conflicts in the interface, or\n    competition for system or program resources, or due to internal\n    limitations of Perl (for example, many modules that use source code\n    filters are mutually incompatible).\n\nNone reported.\n\n\n=head1 BUGS AND LIMITATIONS\n\n=for author to fill in:\n    A list of known problems with the module, together with some\n    indication Whether they are likely to be fixed in an upcoming\n    release. Also a list of restrictions on the features the module\n    does provide: data types that cannot be handled, performance issues\n    and the circumstances in which they may arise, practical\n    limitations on the size of data sets, special cases that are not\n    (yet) handled, etc.\n\nNo bugs have been reported.\n\nPlease report any bugs or feature requests to\nC<bug-rt-extension-ownermove@rt.cpan.org>, or through the web interface at\nL<http://rt.cpan.org>.\n\n\n=head1 AUTHOR\n\nKevin Falcone  C<< <falcone@bestpractical.com> >>\n\n\n=head1 LICENCE AND COPYRIGHT\n\nCopyright (c) 2007, Best Practical Solutions, LLC.  All rights reserved.\n\nThis module is free software; you can redistribute it and/or\nmodify it under the same terms as Perl itself. See L<perlartistic>.\n\n\n=head1 DISCLAIMER OF WARRANTY\n\nBECAUSE THIS SOFTWARE IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE SOFTWARE, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE SOFTWARE \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER\nEXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE\nENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE SOFTWARE IS WITH\nYOU. SHOULD THE SOFTWARE PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL\nNECESSARY SERVICING, REPAIR, OR CORRECTION.\n\nIN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE SOFTWARE AS PERMITTED BY THE ABOVE LICENCE, BE\nLIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL,\nOR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE\nTHE SOFTWARE (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING\nRENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A\nFAILURE OF THE SOFTWARE TO OPERATE WITH ANY OTHER SOFTWARE), EVEN IF\nSUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n=cut\n\n1\n",
      "file" : "/var/tmp/arv_PVrw3u/RT-Extension-ReassignOwner-0.01/lib/RT/Extension/ReassignOwner.pm",
      "package" : "RT::Extension::ReassignOwner"
   }
]
